tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
#ifndef ESP32BASE_WEB_NATIVE_TEST
#define ESP32BASE_WEB_NATIVE_TEST 0
#endif

#if !defined(NATIVE_BUILD) || ESP32BASE_WEB_NATIVE_TEST

#include "web/FaucetWeb.h"

#include "app/AppController.h"
#include "app/AppConfig.h"
#include "app/ConfigStore.h"
#include "app/FilterStore.h"
#include "app/MeteringSchemeStore.h"
#include "app/WaterRecordCalibrationStore.h"
#include "app/WaterRecordStore.h"
#include "app/WaterPulseTraceStore.h"
#include "web/FaucetWebJson.h"
#include "web/FaucetWebParsing.h"
#include "web/FaucetWebPolicy.h"
#include "web/FaucetWebRoutes.h"

#if ESP32BASE_WEB_NATIVE_TEST
#include "web/Esp32BaseWeb.h"
#else
#include <Esp32Base.h>
#endif
#include <algorithm>
#include <cstdarg>
#include <cstdio>
#include <cstdlib>
#include <cstring>
#include <new>

#ifndef FAUCET_WEB_CSS_VERSION
#define FAUCET_WEB_CSS_VERSION __TIME__
#endif

namespace faucet {
namespace {

constexpr std::uint32_t kChartDays = kUsageSummaryMaxDays;
constexpr std::size_t kHomeTodayRecordLimit = 5;
constexpr std::size_t kRawTracePreviewEdgeCount = 30;
constexpr std::uint16_t kSegmentedCalibrationRequiredSamples = 2;
constexpr std::size_t kSegmentedCalibrationMaxSamples = kCalibrationLongTermSampleSlots;
FaucetWebContext g_context{};

struct StablePulseEstimateCache {
    bool ready = false;
    bool valid = false;
    std::size_t ramTraceCount = 0;
    std::uint32_t latestRamTraceId = 0;
    bool latestRamTraceFinished = false;
    float stablePulsePerSec = 0.0f;
};

StablePulseEstimateCache g_stablePulseEstimateCache{};

struct TodayOverview {
    bool timeReady = false;
    std::uint32_t count = 0;
    std::uint32_t volumeMl = 0;
    std::uint32_t durationSec = 0;
    WaterRecord latest[kHomeTodayRecordLimit]{};
    std::size_t latestCount = 0;
};

struct SegmentedSampleDiagnostics {
    SegmentedCalibrationResult result{};
    std::uint16_t longTermSampleCount = 0;
    std::uint16_t measuredSampleCount = 0;
    std::uint16_t validSampleCount = 0;
    std::uint32_t latestSampleTime = 0;
    std::uint32_t latestActualMl = 0;
    std::uint32_t validDurationSecTotal = 0;
    std::uint32_t validActualMlTotal = 0;
};

SegmentedCalibrationOptions calibrationOptionsForWeb() {
    return g_context.config ? segmentedCalibrationOptionsFromConfig(*g_context.config)
                            : defaultSegmentedCalibrationOptions();
}

bool requireContext();
bool contextReady();
bool getParam(const char* name, char* out, std::size_t len);
bool persistConfig(const SystemConfig& config);
bool ensureMeteringSchemesReady();
bool activeMeteringSchemeForWeb(MeteringSchemeRecord& output);
bool meteringSchemeUsedEverForWeb(const MeteringSchemeRecord& scheme);
std::uint32_t estimateVolumeMlFromPulses(std::uint32_t pulseCount, const MeteringParameters& params);
float recentStablePulsePerSec();
void handleRecordDetailPage();
void handleRecordInfoPage();
void handleCalibrationPage();
void handleFlowCalibrationPage();
void handleCalibrationPost();
void handleFlowCalibrationPost();
void handleRecordCalibrationApi();
void handleGenerateSegmentedCalibrationApi();
void handleSaveGeneratedSchemeApi();
void handleDiscardGeneratedSchemeApi();
void handleCreateMeteringSchemeApi();
void handleEditMeteringSchemeApi();
void handleSetActiveMeteringSchemeApi();
void handleDeleteMeteringSchemeApi();
const char* calibrationSessionStatusText(CalibrationSessionStatus status);
bool calibrationSessionInactive(CalibrationSessionStatus status);
bool calibrationSessionStorageReady();
void redirectCalibrationFailure(const char* error);
void redirectCalibrationResult(bool ok, const char* success, const char* failure);
void redirectFlowCalibrationFailure(const char* error);
void redirectFlowCalibrationResult(bool ok, const char* success, const char* failure);
void formatWaterRecordTime(const WaterRecord& record, char* out, std::size_t len);
void formatWaterRecordListTime(const WaterRecord& record, char* out, std::size_t len);
void formatRecordTime(std::uint32_t seconds, char* out, std::size_t len);
void formatFlowLitersPerMin(std::uint32_t flowMlPerMin, char* out, std::size_t len);
void sendNoticeFromQuery();
void sendPageEnd();
void sendManualParameterLink(const char* label, const MeteringParameters& params);

Esp32BaseWeb::Method toBaseMethod(FaucetWebMethod method) {
    switch (method) {
        case FaucetWebMethod::Get:
            return Esp32BaseWeb::METHOD_GET;
        case FaucetWebMethod::Post:
            return Esp32BaseWeb::METHOD_POST;
        default:
            return Esp32BaseWeb::METHOD_GET;
    }
}

void sendFmt(const char* fmt, ...) {
    char buffer[512]{};
    va_list args;
    va_start(args, fmt);
    va_list measureArgs;
    va_copy(measureArgs, args);
    const int written = std::vsnprintf(buffer, sizeof(buffer), fmt, args);
    va_end(args);
    if (written < 0) {
        va_end(measureArgs);
        return;
    }
    if (static_cast<std::size_t>(written) >= sizeof(buffer)) {
        const std::size_t needed = static_cast<std::size_t>(written);
        char* dynamicBuffer = new (std::nothrow) char[needed + 1]{};
        if (!dynamicBuffer) {
            va_end(measureArgs);
            return;
        }
        std::vsnprintf(dynamicBuffer, needed + 1, fmt, measureArgs);
        va_end(measureArgs);
        Esp32BaseWeb::sendChunk(dynamicBuffer);
        delete[] dynamicBuffer;
        return;
    }
    va_end(measureArgs);
    Esp32BaseWeb::sendChunk(buffer);
}

void sendHtmlAttrEscaped(const char* text) {
    for (const char* p = text ? text : ""; *p; ++p) {
        switch (*p) {
            case '&':
                Esp32BaseWeb::sendChunk("&amp;");
                break;
            case '<':
                Esp32BaseWeb::sendChunk("&lt;");
                break;
            case '>':
                Esp32BaseWeb::sendChunk("&gt;");
                break;
            case '"':
                Esp32BaseWeb::sendChunk("&quot;");
                break;
            case '\'':
                Esp32BaseWeb::sendChunk("&#39;");
                break;
            default:
                sendFmt("%c", *p);
                break;
        }
    }
}

