tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void sendMeteringTrialModal() {
    Esp32BaseWeb::sendChunk("<div id='metering-trial-modal' class='metering-trial-modal' aria-hidden='true'>"
                            "<div class='metering-trial-card'><div class='panel-head'><h3>测算</h3>"
                            "<button class='btn-link' type='button' onclick='faucetCloseMeteringTrial()'>关闭</button></div>"
                            "<form class='metering-trial-form' oninput='faucetEstimateMeteringTrial(this)' onchange='faucetEstimateMeteringTrial(this)' onsubmit='return false'>"
                            "<p class='generated-note' data-trial-label>-</p>"
                            "<div class='trial-estimator-grid'><section class='trial-estimator-panel'><h4>容量目标</h4>"
                            "<label class='compact-field'><span>目标水量</span><span class='estimator-input-row'>"
                            "<input name='targetMl' type='number' min='1' max='");
    sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
    Esp32BaseWeb::sendChunk("' step='1' value='1000'><span class='unit-label'>ml</span></span></label>"
                            "<div class='estimate-results'><div><span>预计出水时长</span><strong data-volume-estimated-duration>-</strong></div>"
                            "<div><span>预计脉冲总数</span><strong data-volume-estimated-pulses>-</strong></div></div></section>"
                            "<section class='trial-estimator-panel'><h4>时间目标</h4>"
                            "<label class='compact-field'><span>出水时长</span><span class='estimator-input-row'>"
                            "<input name='targetSec' type='number' min='1' max='1800' step='1' value='60'><span class='unit-label'>秒</span></span></label>"
                            "<div class='estimate-results'><div><span>预计出水量</span><strong data-time-estimated-volume>-</strong></div>"
                            "<div><span>预计脉冲总数</span><strong data-time-estimated-pulses>-</strong></div></div></section></div>"
                            "<p class='generated-note'>测算只按当前按钮提供的计量参数计算，不会远程启动出水。</p>"
                            "</form></div></div>");
}

void sendManualParameterLink(const char* label, const MeteringParameters& params) {
    sendFmt("<a class='btn-link' href='/faucet/calibration/flow?manual=1&startupPulseCount=%lu&startupVolumeMl=%lu&stablePulsePerLiter=%lu&startupDurationMs=%lu&stableFlowMlPerMin=%lu'>%s</a>",
            static_cast<unsigned long>(params.startupPulseCount),
            static_cast<unsigned long>(params.startupVolumeMl),
            static_cast<unsigned long>(params.stablePulsePerLiter),
            static_cast<unsigned long>(params.startupDurationMs),
            static_cast<unsigned long>(params.stableFlowMlPerMin),
            label ? label : "复制参数");
}

void sendCalibrationParameterPanels() {
    MeteringSchemeRecord* schemes = new (std::nothrow) MeteringSchemeRecord[kMeteringSchemeStoreSlotCount]{};
    const bool ready = ensureMeteringSchemesReady();
    const std::size_t count =
        ready && schemes ? g_context.meteringSchemes->list(schemes, kMeteringSchemeStoreSlotCount, false) : 0;
    const std::uint32_t activeId = ready ? g_context.meteringSchemes->activeSchemeId() : 0;
    char createdText[24]{};
    std::uint32_t createdSchemeId = 0;
    if (getParam("createdScheme", createdText, sizeof(createdText))) {
        parseU32(createdText, createdSchemeId);
    }

    Esp32BaseWeb::sendChunk("<section id='metering-scheme-list' class='panel calibration-param-panel'><div class='panel-head'><h3>历史参数</h3>"
                            "<a class='btn-link' href='/faucet/calibration/flow?manual=1'>手工输入参数</a></div>"
                            "<table class='calibration-slot-table metering-scheme-table'><tr><th>参数</th><th>状态</th><th>启动阶段</th><th>稳态阶段</th><th>样本与误差</th><th>操作</th></tr>");
    if (!ready) {
        const AppStorageStatus status =
            g_context.meteringSchemes ? g_context.meteringSchemes->status() : AppStorageStatus::Unavailable;
        sendFmt("<tr><td colspan='6'>历史参数存储不可用：%s（%s）。</td></tr>",
                appStorageStatusMessage(status),
                appStorageStatusCode(status));
    } else if (!schemes) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='6'>内存不足，无法加载历史参数。</td></tr>");
    } else if (count == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='6'>还没有历史参数。可以手工输入一组参数。</td></tr>");
    }
    for (std::size_t i = 0; i < count; ++i) {
        const MeteringSchemeRecord& scheme = schemes[i];
        char startupVolume[24]{};
        char startupDuration[24]{};
        char stableFlow[24]{};
        char minActual[20]{};
        char maxActual[20]{};
        char maxError[20]{};
        formatLiters(scheme.params.startupVolumeMl, startupVolume, sizeof(startupVolume));
        formatStartupDurationSeconds(scheme.params.startupDurationMs, startupDuration, sizeof(startupDuration));
        formatFlowLitersPerMin(scheme.params.stableFlowMlPerMin, stableFlow, sizeof(stableFlow));
        if (scheme.sampleCount > 0) {
            formatLiters(scheme.minActualMl, minActual, sizeof(minActual));
            formatLiters(scheme.maxActualMl, maxActual, sizeof(maxActual));
            formatLiters(scheme.maxErrorMl, maxError, sizeof(maxError));
        }

        sendFmt("<tr class='%s%s'><td><b>#%lu ",
                scheme.id == activeId ? "is-active " : "",
                scheme.id == createdSchemeId ? "scheme-created-row" : "",
                static_cast<unsigned long>(scheme.id));
        sendHtmlEscapedBounded(scheme.name, sizeof(scheme.name));
        sendFmt("</b><small>rev %lu</small></td><td>",
                static_cast<unsigned long>(scheme.revision));
        if (scheme.id == activeId) {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-ok'>正在使用</span>");
            if (scheme.id == createdSchemeId) {
                Esp32BaseWeb::sendChunk(" <span class='status-pill status-warn'>刚保存</span>");
            }
        } else {
            Esp32BaseWeb::sendChunk("<span class='status-pill status-muted'>可用</span>");
            if (scheme.id == createdSchemeId) {
                Esp32BaseWeb::sendChunk(" <span class='status-pill status-warn'>刚保存</span>");
            }
        }
        sendFmt(" <span class='status-pill status-muted'>%s</span>",
                meteringSchemeUsedEverForWeb(scheme) ? "已使用" : "未使用");
        sendFmt("</td><td><div class='scheme-param-lines'><span>启动脉冲：%luP</span><span>启动水量：%s</span><span>启动时长：%s</span></div></td>"
                "<td><div class='scheme-param-lines'><span>容量计量：%luP/L</span><span>时间估算：%s</span></div></td>"
                "<td><div class='scheme-param-lines'>",
                static_cast<unsigned long>(scheme.params.startupPulseCount),
                startupVolume,
                startupDuration,
                static_cast<unsigned long>(scheme.params.stablePulsePerLiter),
                stableFlow);
        if (scheme.sampleCount > 0) {
            sendFmt("<span>样本：%u 条</span><span>容量范围：%s - %s</span><span>最大误差：%s / %u.%u%%</span>",
                    static_cast<unsigned>(scheme.sampleCount),
                    minActual,
                    maxActual,
                    maxError,
                    static_cast<unsigned>(scheme.maxErrorTenthPercent / 10U),
                    static_cast<unsigned>(scheme.maxErrorTenthPercent % 10U));
        } else {
            Esp32BaseWeb::sendChunk("<span>样本：无样本摘要</span><span>最大误差：-</span>");
        }
        Esp32BaseWeb::sendChunk("</div></td><td><div class='row-actions scheme-row-actions'>");
        sendSchemeDetailButton(scheme, activeId);
        sendMeteringTrialButton(scheme.name[0] ? scheme.name : "计量方案", scheme.params, 1000, 10);
        sendManualParameterLink("复制参数", scheme.params);
        if (scheme.id != activeId) {
            sendFmt("<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认使用这组计量参数？')&&once(this)\"><input type='hidden' name='action' value='set_active_metering_scheme'><input type='hidden' name='id' value='%lu'><input class='primary' type='submit' value='使用这组参数'></form>",
                    static_cast<unsigned long>(scheme.id));
        }
        Esp32BaseWeb::sendChunk("</div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table>");
    if (ready && count == kMeteringSchemeStoreSlotCount) {
        Esp32BaseWeb::sendChunk("<p class='muted'>历史参数数量已满；请先整理高级维护里的旧参数。</p>");
    }
    sendSchemeDetailModal();
    Esp32BaseWeb::sendChunk("</section>");
    delete[] schemes;
}

void sendMeteringSchemeEditPage(bool creating, const MeteringSchemeRecord* scheme) {
    const char* title = creating ? "手工输入参数" : "复制参数";
    Esp32BaseWeb::sendHeader(title);
    sendFmt("<h2>%s</h2><p><a class='btn-link' href='/faucet/calibration/flow'>返回校准</a></p>", title);
    sendNoticeFromQuery();
    const MeteringParameters params = scheme ? scheme->params : MeteringParameters{};
    const bool hasValues = scheme != nullptr;
    const bool editingActive = !creating && scheme && ensureMeteringSchemesReady() &&
                               scheme->id == g_context.meteringSchemes->activeSchemeId();
    Esp32BaseWeb::sendChunk("<section class='panel calibration-param-panel scheme-edit-panel'><form class='scheme-edit-form' method='post' action='/faucet/calibration/flow' onsubmit='return once(this)'>");
    Esp32BaseWeb::sendChunk(creating ? "<input type='hidden' name='action' value='create_metering_scheme'>"
                                     : "<input type='hidden' name='action' value='edit_metering_scheme'>");
    if (!creating && scheme) {
        sendFmt("<input type='hidden' name='id' value='%lu'>", static_cast<unsigned long>(scheme->id));
    }
    if (editingActive) {
        Esp32BaseWeb::sendChunk("<p class='warn scheme-edit-warning'>当前方案：保存后会立即影响后续出水估算。</p>");
    }
    Esp32BaseWeb::sendChunk("<div class='scheme-edit-section'><h3>参数信息</h3><div class='scheme-edit-grid'>");
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-12'><span>名称</span><input name='name' maxlength='%u' required value='",
            static_cast<unsigned>(kMeteringSchemeNameLength - 1));
    if (scheme && scheme->name[0]) {
        sendHtmlAttrEscapedBounded(scheme->name, sizeof(scheme->name));
    }
    Esp32BaseWeb::sendChunk("'></label>");
    if (!creating && scheme) {
        sendFmt("<div class='scheme-edit-meta scheme-span-12'><span>#%lu</span><span>rev %lu</span><span>%s</span></div>",
                static_cast<unsigned long>(scheme->id),
                static_cast<unsigned long>(scheme->revision),
                scheme->deleted ? "已删除" : "可用");
    }
    Esp32BaseWeb::sendChunk("</div></div><div class='scheme-edit-section'><h3>容量估算计量参数</h3><div class='scheme-edit-grid'>");
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>启动脉冲数</span><input name='startupPulseCount' type='number' min='0' max='%lu' step='1' required%s",
            static_cast<unsigned long>(kMaxSegmentedStartupPulseCount),
            hasValues ? " value='" : "");
    if (hasValues) {
        sendFmt("%lu'", static_cast<unsigned long>(params.startupPulseCount));
    }
    sendFmt("><small class='hint'>单位 P，范围 0-%lu</small></label>",
            static_cast<unsigned long>(kMaxSegmentedStartupPulseCount));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>启动水量</span><input name='startupVolumeMl' type='number' min='0' max='%lu' step='1' required%s",
            static_cast<unsigned long>(kMaxSegmentedStartupVolumeMl),
            hasValues ? " value='" : "");
    if (hasValues) {
        sendFmt("%lu'", static_cast<unsigned long>(params.startupVolumeMl));
    }
    sendFmt("><small class='hint'>单位 ml，范围 0-%lu</small></label>",
            static_cast<unsigned long>(kMaxSegmentedStartupVolumeMl));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>稳态 P/L</span><input name='stablePulsePerLiter' type='number' min='%lu' max='%lu' step='1' required%s",
            static_cast<unsigned long>(kMinSegmentedPulsePerLiter),
            static_cast<unsigned long>(kMaxSegmentedPulsePerLiter),
            hasValues ? " value='" : "");
    if (hasValues) {
        sendFmt("%lu'", static_cast<unsigned long>(params.stablePulsePerLiter));
    }
    sendFmt("><small class='hint'>单位 P/L，范围 %lu-%lu</small></label>",
            static_cast<unsigned long>(kMinSegmentedPulsePerLiter),
            static_cast<unsigned long>(kMaxSegmentedPulsePerLiter));
    Esp32BaseWeb::sendChunk("</div></div><div class='scheme-edit-section'><h3>时间估算计量参数</h3><p class='muted'>仅用于预计时间和预计流速展示，不参与实际容量、滤芯累计或统计累计。</p><div class='scheme-edit-grid'>");
    char startupDurationSec[24]{};
    formatStartupDurationSecondsInput(params.startupDurationMs, startupDurationSec, sizeof(startupDurationSec));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>启动时长</span><input name='startupDurationSec' type='number' min='0' max='%lu' step='0.001' required%s",
            static_cast<unsigned long>(kMaxSegmentedStartupDurationMs / 1000U),
            hasValues ? " value='" : "");
    if (hasValues) {
        sendFmt("%s'", startupDurationSec);
    }
    sendFmt("><small class='hint'>单位 秒，范围 0-%lu，可精确到 0.001 秒</small></label>",
            static_cast<unsigned long>(kMaxSegmentedStartupDurationMs / 1000U));
    sendFmt("<label class='compact-field scheme-edit-field scheme-span-4'><span>预计稳态流速</span><input name='stableFlowMlPerMin' type='number' min='%lu' max='%lu' step='1' required%s",
            static_cast<unsigned long>(kMinStableFlowMlPerMin),
            static_cast<unsigned long>(kMaxStableFlowMlPerMin),
            hasValues ? " value='" : "");
    if (hasValues) {
        sendFmt("%lu'", static_cast<unsigned long>(params.stableFlowMlPerMin));
    }
    sendFmt("><small class='hint'>单位 ml/min，范围 %lu-%lu</small></label>",
            static_cast<unsigned long>(kMinStableFlowMlPerMin),
            static_cast<unsigned long>(kMaxStableFlowMlPerMin));
    Esp32BaseWeb::sendChunk("</div></div>");
    Esp32BaseWeb::sendChunk(creating ? "<div class='form-actions scheme-edit-actions'><input class='primary' type='submit' value='保存参数'>"
                                     : "<div class='form-actions scheme-edit-actions'><input class='primary' type='submit' value='保存参数'>");
    Esp32BaseWeb::sendChunk("<a class='btn-link' href='/faucet/calibration/flow'>取消</a></div></form></section>");
    sendPageEnd();
}

bool readMeteringManualPrefillFromQuery(MeteringParameters& params, bool& present) {
    present = false;
    char text[32]{};
    if (!getParam("startupPulseCount", text, sizeof(text))) {
        return true;
    }
    present = true;
    if (!parseU32(text, params.startupPulseCount) ||
        !getParam("startupVolumeMl", text, sizeof(text)) || !parseU32(text, params.startupVolumeMl) ||
        !getParam("stablePulsePerLiter", text, sizeof(text)) || !parseU32(text, params.stablePulsePerLiter) ||
        !getParam("startupDurationMs", text, sizeof(text)) || !parseU32(text, params.startupDurationMs) ||
        !getParam("stableFlowMlPerMin", text, sizeof(text)) || !parseU32(text, params.stableFlowMlPerMin)) {
        return false;
    }
    return validMeteringSchemeParameters(params);
}


