tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
    CalibrationStoredTrace stored{};
    const bool hasStoredTrace = g_context.calibrationSessionTraces && g_context.calibrationSessionTraces->ready() &&
                                attempt.sessionTraceSlot < kCalibrationSessionTraceSlots &&
                                g_context.calibrationSessionTraces->load(attempt.sessionTraceSlot, stored);
    std::uint32_t firstWindowPulses = 0;
    bool firstWindowReady = false;
    if (hasStoredTrace && samplePulseWindowSec > 0 && stored.trace.sampleCount > 0) {
        WaterPulseTraceSample* traceSamples = new (std::nothrow) WaterPulseTraceSample[stored.trace.sampleCount]{};
        if (traceSamples) {
            const std::size_t copied = g_context.calibrationSessionTraces->readSamples(
                attempt.sessionTraceSlot, traceSamples, stored.trace.sampleCount);
            if (copied == stored.trace.sampleCount) {
                std::size_t count = 0;
                const std::uint32_t endUs = samplePulseWindowSec * 1000000UL;
                while (count < copied && traceSamples[count].elapsedUs < endUs) {
                    ++count;
                }
                firstWindowPulses = effectivePulseCount(stored.trace, traceSamples, count);
                firstWindowReady = true;
            }
            delete[] traceSamples;
        }
    }
    const bool stableReady =
        attempt.status == CalibrationAttemptStatus::Valid && !attempt.resumedAfterPause && !attempt.truncated;
    std::uint32_t sampleId = 0;
    const bool saved = attempt.status == CalibrationAttemptStatus::Valid &&
                       findLongTermSampleForAttempt(session.sessionId, attempt.attemptIndex, sampleId);

    sendFmt("<tr><td>%s</td><td>%s</td><td>%s</td><td>%s</td><td>%s</td><td>%luP</td><td>",
            timeText,
            durationText,
            attempt.targetHintMl > 0 ? targetText : "-",
            attempt.record.volumeMl > 0 ? estimateText : "-",
            actualText,
            static_cast<unsigned long>(attempt.record.pulseCount));
    if (firstWindowReady) {
        sendFmt("%luP", static_cast<unsigned long>(firstWindowPulses));
    } else {
        Esp32BaseWeb::sendChunk("-");
    }
    sendFmt("</td><td><span class='status-pill %s'>%s</span></td><td>本次会话 #%u</td><td><span class='status-pill %s'>%s</span>",
            stableReady ? "status-ok" : (attempt.status == CalibrationAttemptStatus::Invalid ? "status-warn" : "status-muted"),
            stableReady ? "稳态可用" : (attempt.status == CalibrationAttemptStatus::Invalid ? calibrationInvalidReasonText(attempt.invalidReason) : "-"),
            static_cast<unsigned>(attempt.attemptIndex + 1),
            attempt.status == CalibrationAttemptStatus::Valid ? "status-ok" :
                (attempt.status == CalibrationAttemptStatus::Invalid ? "status-warn" : "status-muted"),
            calibrationAttemptStatusText(attempt.status));
    Esp32BaseWeb::sendChunk("</td><td>");
    bool renderedAction = false;
    if (saved) {
        sendFmt("<span class='hint'>历史样本 #%lu</span>", static_cast<unsigned long>(sampleId));
        renderedAction = true;
    }
    if (attempt.status == CalibrationAttemptStatus::Valid || attempt.status == CalibrationAttemptStatus::PendingActual) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration/flow' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='remove_sample'>"
                                "<input type='hidden' name='attemptIndex' value='");
        sendFmt("%u", static_cast<unsigned>(attempt.attemptIndex));
        Esp32BaseWeb::sendChunk("'><input class='danger' type='submit' value='移除'></form>");
        renderedAction = true;
    }
    if (!renderedAction) {
        Esp32BaseWeb::sendChunk("<span class='hint'>无可用操作</span>");
    }
    Esp32BaseWeb::sendChunk("</td></tr>");
}

void sendCalibrationSamplesPanel(std::uint32_t samplePulseWindowSec) {
    Esp32BaseWeb::sendChunk("<section id='calibration-samples' class='panel'><div class='panel-head'><h3>本次校准样本</h3></div>"
                            "<p class='hint'>这里记录当前校准会话的接水记录；有效样本会自动刷新推荐参数，异常或误操作样本可移除。</p>");
    sendFmt("<table class='calibration-sample-table'><tr><th>时间</th><th>时长</th><th>目标容量</th><th>估算出水</th><th>量杯实测</th><th>总脉冲</th><th>前 %u 秒脉冲</th><th>稳态识别</th><th>样本来源</th><th>校准用途</th><th>操作</th></tr>",
            static_cast<unsigned>(samplePulseWindowSec));
    if (!g_context.calibrationSessions || !g_context.calibrationSessions->ready()) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='11'>校准会话存储未就绪，暂时不能读取本次接水记录。</td></tr></table></section>");
        return;
    }
    CalibrationSessionRecord session{};
    if (!g_context.calibrationSessions->load(session) || session.attemptCount == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='11'>还没有本次校准样本。进入校准模式后，每次本地出水都会记录到这里。</td></tr></table></section>");
        return;
    }
    bool rendered = false;
    for (std::uint8_t i = 0; i < session.attemptCount && i < kCalibrationMaxAttempts; ++i) {
        const CalibrationAttempt& attempt = session.attempts[i];
        if (attempt.status == CalibrationAttemptStatus::Empty) {
            continue;
        }
        sendCalibrationSessionAttemptRow(session, attempt, samplePulseWindowSec);
        rendered = true;
    }
    if (!rendered) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='11'>还没有本次校准样本。进入校准模式后，每次本地出水都会记录到这里。</td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table></section>");
}

bool findLongTermSampleForAttempt(std::uint32_t sessionId,
                                  std::uint8_t attemptIndex,
                                  std::uint32_t& sampleId) {
    sampleId = 0;
    if (!g_context.calibrationLongTermSamples || !g_context.calibrationLongTermSamples->ready()) {
        return false;
    }
    CalibrationStoredTrace samples[kCalibrationLongTermSampleSlots]{};
    const std::size_t count = g_context.calibrationLongTermSamples->list(samples, kCalibrationLongTermSampleSlots);
    for (std::size_t i = 0; i < count; ++i) {
        if (samples[i].sessionId == sessionId && samples[i].attemptIndex == attemptIndex) {
            sampleId = samples[i].sampleId;
            return true;
        }
    }
    return false;
}

void sendLongTermSampleLibraryTable() {
    if (!g_context.calibrationLongTermSamples || !g_context.calibrationLongTermSamples->ready()) {
        const AppStorageStatus status =
            g_context.calibrationLongTermSamples ? g_context.calibrationLongTermSamples->status()
                                                 : AppStorageStatus::Unavailable;
        sendFmt("<p class='hint'>长期样本库不可用：%s（%s）。普通校准仍可使用本次会话样本生成并应用方案。</p>",
                appStorageStatusMessage(status),
                appStorageStatusCode(status));
        Esp32BaseWeb::sendChunk("<table class='long-term-sample-table'><tr><th>时间</th><th>实测容量</th><th>总脉冲</th><th>数据点</th><th>样本状态</th></tr>"
                                "<tr><td colspan='5'>长期样本库暂不可用。</td></tr></table>");
        return;
    }

    CalibrationStoredTrace samples[kCalibrationLongTermSampleSlots]{};
    const std::size_t count = g_context.calibrationLongTermSamples->list(samples, kCalibrationLongTermSampleSlots);
    char maxBytes[24]{};
    const std::size_t approximateBytes =
        kCalibrationLongTermSampleSlots * static_cast<std::size_t>(kPulseTraceMaxRawEdgesPerTrace) *
        sizeof(WaterPulseTraceSample);
    formatKb(approximateBytes, maxBytes, sizeof(maxBytes));
    sendFmt("<p class='hint'>已保存 %u / %u 条 · 单条最多 %lu 点 · 文件约 %s。长期样本只在用户显式保存时写入，不自动覆盖。</p>",
            static_cast<unsigned>(count),
            static_cast<unsigned>(kCalibrationLongTermSampleSlots),
            static_cast<unsigned long>(kPulseTraceMaxRawEdgesPerTrace),
            maxBytes);
    if (count >= kCalibrationLongTermSampleSlots) {
        Esp32BaseWeb::sendChunk("<p class='warn'>长期样本库已满，请先手动删除不需要的样本，再保存新的长期样本。</p>");
    }
    Esp32BaseWeb::sendChunk("<table class='long-term-sample-table'><tr><th>时间</th><th>实测容量</th><th>总脉冲</th><th>数据点</th><th>样本状态</th></tr>");
    if (count == 0) {
        Esp32BaseWeb::sendChunk("<tr><td colspan='5'>还没有长期样本。完成校准会话后，可把优质样本存入这里用于专业生成和复核。</td></tr></table>");
        return;
    }

    for (std::size_t i = 0; i < count; ++i) {
        char timeText[40]{};
        char actualText[24]{};
        formatWaterRecordListTime(samples[i].trace.record, timeText, sizeof(timeText));
        formatLitersMl(samples[i].actualMl, actualText, sizeof(actualText));
        const bool usable = samples[i].valid && !samples[i].pendingActual && samples[i].actualMl > 0 &&
                            !samples[i].trace.truncated && !samples[i].trace.resumedAfterPause &&
                            samples[i].trace.totalPulses > 0 && samples[i].trace.sampleCount > 0;
        sendFmt("<tr><td>%s</td><td>%s</td><td>%luP</td><td>%lu</td><td><span class='status-pill %s'>%s</span></td></tr>",
                timeText,
                actualText,
                static_cast<unsigned long>(samples[i].trace.totalPulses),
                static_cast<unsigned long>(samples[i].trace.sampleCount),
                usable ? "status-ok" : "status-muted",
                usable ? "可用于生成" : "不可用于生成");
    }
    Esp32BaseWeb::sendChunk("</table>");
}

void sendGeneratedSampleResiduals(const MeteringSchemeCandidate& candidate,
                                  const SegmentedCalibrationOptions& options) {
    if (!g_context.calibrationLongTermSamples || !g_context.calibrationLongTermSamples->ready()) {
        return;
    }
    CalibrationStoredTrace samples[kCalibrationLongTermSampleSlots]{};
    const std::size_t sampleCount =
        g_context.calibrationLongTermSamples->list(samples, kCalibrationLongTermSampleSlots);
    bool opened = false;
    for (std::size_t i = 0; i < sampleCount; ++i) {
        const CalibrationStoredTrace& sample = samples[i];
        const WaterPulseTrace& trace = sample.trace;
        const std::uint32_t actualMl = sample.actualMl;
        if (!sample.valid || sample.pendingActual || actualMl == 0 || trace.truncated ||
            trace.resumedAfterPause || trace.sampleCount < 6 || trace.totalPulses == 0 || sample.sampleId == 0) {
            continue;
        }
        WaterPulseTraceSample* traceSamples = new (std::nothrow) WaterPulseTraceSample[trace.sampleCount]{};
        if (!traceSamples) {
            continue;
        }
        const bool copied =
            g_context.calibrationLongTermSamples->readSamples(sample.sampleId, traceSamples, trace.sampleCount) ==
            trace.sampleCount;
        const WaterPulseTraceAnalysis analysis =
            copied ? analyzeWaterPulseTrace(trace, traceSamples, trace.sampleCount, options) : WaterPulseTraceAnalysis{};
        delete[] traceSamples;
        if (!analysis.stable || analysis.stablePulseCount == 0 || candidate.params.stablePulsePerLiter == 0) {
            continue;
        }
        if (!opened) {
            Esp32BaseWeb::sendChunk("<table class='generated-residual-table'><tr><th>样本</th><th>启动</th><th>稳态脉冲</th><th>实测</th><th>拟合估算</th><th>误差</th><th>状态</th></tr>");
            opened = true;
        }
        char startTime[40]{};
        char actual[24]{};
        char estimated[24]{};
        char errorText[24]{};
        formatWaterRecordListTime(trace.record, startTime, sizeof(startTime));
        const std::uint64_t estimatedMl64 =
            static_cast<std::uint64_t>(candidate.params.startupVolumeMl) +
            (static_cast<std::uint64_t>(analysis.stablePulseCount) * 1000ULL +
             candidate.params.stablePulsePerLiter / 2ULL) /
                candidate.params.stablePulsePerLiter;
        const std::uint32_t estimatedMl =
            estimatedMl64 > UINT32_MAX ? UINT32_MAX : static_cast<std::uint32_t>(estimatedMl64);
        const std::int32_t diff = static_cast<std::int32_t>(estimatedMl) - static_cast<std::int32_t>(actualMl);
        const std::uint32_t absDiff = diff < 0 ? static_cast<std::uint32_t>(-diff) : static_cast<std::uint32_t>(diff);
        const std::uint32_t relTenths =
            actualMl == 0 ? 0 : static_cast<std::uint32_t>((static_cast<std::uint64_t>(absDiff) * 1000ULL + actualMl / 2ULL) / actualMl);
        formatLitersMl(actualMl, actual, sizeof(actual));
        formatLitersMl(estimatedMl, estimated, sizeof(estimated));
        std::snprintf(errorText,
                      sizeof(errorText),
                      "%c%lu.%03lu L / %lu.%lu%%",
                      diff < 0 ? '-' : '+',
                      static_cast<unsigned long>(absDiff / 1000UL),
                      static_cast<unsigned long>(absDiff % 1000UL),
                      static_cast<unsigned long>(relTenths / 10UL),
                      static_cast<unsigned long>(relTenths % 10UL));
        sendFmt("<tr><td>%s</td><td>%luP / 第%lus</td><td>%luP</td><td>%s</td><td>%s</td><td>%s</td><td>",
                startTime,
                static_cast<unsigned long>(analysis.startupPulseCount),
                static_cast<unsigned long>(analysis.stableStartSec),
                static_cast<unsigned long>(analysis.stablePulseCount),
                actual,
                estimated,
                errorText);
        Esp32BaseWeb::sendChunk((absDiff > options.maxErrorMl || relTenths > options.maxRelativeErrorTenthPercent)
                                    ? "<span class='status-pill status-warn'>误差偏大</span>"
                                    : "<span class='status-pill status-ok'>通过</span>");
        Esp32BaseWeb::sendChunk("</td></tr>");
    }
    if (opened) {
        Esp32BaseWeb::sendChunk("</table>");
    }
}

void sendCalibrationGenerationSummaryPanel() {
    const SegmentedCalibrationOptions options = calibrationOptionsForWeb();
    Esp32BaseWeb::sendChunk("<section id='scheme-generation' class='panel'><div class='panel-head'><div><h3>高级样本库</h3>"
                            "<p class='hint'>这里用于查看历史样本明细和做辅助计算；计算结果不会自动改变当前计量参数。</p></div>"
                            "<form method='post' action='/faucet/calibration/flow' onsubmit='return faucetSubmitGenerationAction(this)'>"
                            "<input type='hidden' name='action' value='generate_segmented'>"
                            "<input type='hidden' name='ajax' value='1'>"
                            "<input class='primary' type='submit' value='辅助计算'></form></div>"
                            "<div class='calibration-generation-settings'>");
    sendFmt("<span>分析脉冲间隔 <b>%s</b></span>",
            options.pulseMinIntervalUsOverride == 0 ? "记录值" : "覆盖值");
    if (options.pulseMinIntervalUsOverride != 0) {
        sendFmt("<span><b>%luus</b></span>", static_cast<unsigned long>(options.pulseMinIntervalUsOverride));
    }
    sendFmt("<span>稳态窗口 <b>%lus</b></span><span>稳态容差 <b>%u%%</b></span>"
            "<span>容量跨度提醒 <b>%luml</b></span><span>误差提醒阈值 <b>%luml / %u.%u%%</b></span></div>",
            static_cast<unsigned long>(options.stableWindowSec),
            static_cast<unsigned>(options.stableTolerancePercent),
            static_cast<unsigned long>(options.minVolumeSpanMl),
            static_cast<unsigned long>(options.maxErrorMl),
            static_cast<unsigned>(options.maxRelativeErrorTenthPercent / 10U),
            static_cast<unsigned>(options.maxRelativeErrorTenthPercent % 10U));
    sendLongTermSampleLibraryTable();
    Esp32BaseWeb::sendChunk("</section>");
}

