tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void handleFlowCalibrationPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (!requireContext()) {
        return;
    }
    if (Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        handleFlowCalibrationPost();
        return;
    }
    char text[32]{};
    if (getParam("partial", text, sizeof(text))) {
        if (!Esp32BaseWeb::beginResponse(200, "text/html; charset=utf-8", nullptr)) {
            return;
        }
        if (std::strcmp(text, "schemes") == 0) {
            sendCalibrationParameterPanels();
        } else if (std::strcmp(text, "generation-summary") == 0) {
            sendCalibrationGenerationSummaryPanel();
        } else if (std::strcmp(text, "generation") == 0) {
            sendCalibrationGenerationPanel();
        }
        Esp32BaseWeb::endResponse();
        return;
    }
    if (getParam("advanced", text, sizeof(text)) && std::strcmp(text, "samples") == 0) {
        Esp32BaseWeb::sendHeader("高级样本库");
        Esp32BaseWeb::sendChunk("<h2>高级样本库</h2><p><a class='btn-link' href='/faucet/calibration/flow'>返回流量计校准</a></p>");
        sendNoticeFromQuery();
        sendCalibrationGenerationPanel();
        sendMeteringTrialModal();
        sendCalibrationPageScript();
        sendPageEnd();
        return;
    }
    if (getParam("manual", text, sizeof(text))) {
        MeteringParameters prefill{};
        bool hasPrefill = false;
        if (!readMeteringManualPrefillFromQuery(prefill, hasPrefill)) {
            Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_value");
            return;
        }
        MeteringSchemeRecord draft{};
        if (hasPrefill) {
            initializeManualMeteringScheme(draft, 0, "手工参数", prefill, g_context.nowSeconds ? g_context.nowSeconds() : 0);
        }
        sendMeteringSchemeEditPage(true, hasPrefill ? &draft : nullptr);
        return;
    }
    if (getParam("scheme", text, sizeof(text))) {
        if (std::strcmp(text, "new") == 0) {
            sendMeteringSchemeEditPage(true, nullptr);
            return;
        }
        std::uint32_t id = 0;
        MeteringSchemeRecord scheme{};
        if (!parseU32(text, id) || !ensureMeteringSchemesReady() || !g_context.meteringSchemes->findById(id, scheme) ||
            scheme.deleted) {
            Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_value");
            return;
        }
        sendMeteringSchemeEditPage(true, &scheme);
        return;
    }

    const AppSnapshot snapshot = g_context.app->snapshot();
    const bool taskActive = waterTaskActive();
    const bool sessionActive = snapshot.calibrationStatus != CalibrationSessionStatus::Idle &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Applied &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Discarded &&
                               snapshot.calibrationStatus != CalibrationSessionStatus::Failed;
    const bool canStartSession = calibrationSessionInactive(snapshot.calibrationStatus) && !taskActive;
    const bool canDiscardSession = sessionActive && snapshot.calibrationStatus != CalibrationSessionStatus::Running && !taskActive;
    const bool canEnterActual = snapshot.calibrationStatus == CalibrationSessionStatus::AwaitingActual;
    const bool canApply = snapshot.calibrationStatus == CalibrationSessionStatus::Generated && !taskActive;

    Esp32BaseWeb::sendHeader("流量计校准");
    Esp32BaseWeb::sendChunk("<h2>流量计校准</h2>");
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<p class='muted'>本页展示当前计量参数和本次校准样本；本页不提供远程出水或停水能力。</p>");
    Esp32BaseWeb::sendChunk("<section class='panel calibration-session-panel'><div class='panel-head'><h3>校准流程</h3><div class='calibration-session-badges'>");
    sendFmt("<span class='status-pill %s'>%s</span>",
            sessionActive ? "status-warn" : "status-muted",
            calibrationSessionStatusText(snapshot.calibrationStatus));
    if (sessionActive) {
        const std::uint32_t nowSeconds = g_context.nowSeconds ? g_context.nowSeconds() : 0;
        const std::uint32_t remainingSec =
            nowSeconds > 0 && snapshot.calibrationIdleExpiresAt > nowSeconds
                ? snapshot.calibrationIdleExpiresAt - nowSeconds
                : kCalibrationIdleTimeoutSec;
        sendFmt("<span class='status-pill status-muted calibration-timeout-pill' data-calibration-countdown data-remaining='%lu'>非出水中 30 分钟无操作自动退出</span>",
                static_cast<unsigned long>(remainingSec));
    }
    Esp32BaseWeb::sendChunk("</div></div><p class='muted'>至少 2 条有效样本后会自动生成参数；3 条以上更稳。到设备旁按 OK 接水，网页只记录实测容量和使用结果。</p><div class='form-actions calibration-primary-actions'>");
    if (!sessionActive) {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration/flow' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='start_session'>");
        sendFmt("<input class='primary' type='submit' value='开始校准流程'%s></form>",
                canStartSession ? "" : " disabled");
    } else {
        Esp32BaseWeb::sendChunk("<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认退出并丢弃本次校准会话？')&&once(this)\">"
                                "<input type='hidden' name='action' value='discard_session'>");
        sendFmt("<input class='secondary' type='submit' value='退出校准流程'%s></form>",
                canDiscardSession ? "" : " disabled");
    }
    Esp32BaseWeb::sendChunk("</div>");
    if (canEnterActual) {
        Esp32BaseWeb::sendChunk("<form class='sample-calibration-form' method='post' action='/faucet/calibration/flow' onsubmit='return once(this)'>"
                                "<input type='hidden' name='action' value='save_actual'>"
                                "<label class='compact-field'><span>本次实测容量</span><span class='estimator-input-row'>"
                                "<input name='actualMl' type='number' min='");
        sendFmt("%lu", static_cast<unsigned long>(kCalibrationMinActualMl));
        Esp32BaseWeb::sendChunk("' max='");
        sendFmt("%lu", static_cast<unsigned long>(kMaxVolumePresetMl));
        Esp32BaseWeb::sendChunk("' step='1' required><span class='unit-label'>ml</span></span></label>"
                                "<div class='form-actions'><input class='primary' type='submit' value='保存有效样本'></form>"
                                "<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认放弃本次出水样本？')&&once(this)\">"
                                "<input type='hidden' name='action' value='skip_attempt'>"
                                "<input class='danger' type='submit' value='放弃本次样本'></form></div>");
    }
    Esp32BaseWeb::sendChunk("<div class='form-actions calibration-secondary-actions'>"
                            "<form method='post' action='/faucet/calibration/flow' onsubmit=\"return confirm('确认使用这组计量参数？')&&once(this)\">"
                            "<input type='hidden' name='action' value='apply_session'>");
    sendFmt("<input class='primary' type='submit' value='使用这组参数'%s></form></div></section>",
            canApply ? "" : " disabled");
    sendCalibrationSamplesPanel(configuredPulseObservationWindowSec());
    Esp32BaseWeb::sendChunk("<div class='calibration-param-layout'>");
    sendActiveMeteringSchemeSummaryPanel();
    Esp32BaseWeb::sendChunk("</div>");
    sendCalibrationParameterPanels();
    sendMeteringTrialModal();
    sendCalibrationPageScript();
    sendPageEnd();
}

void handleRecordDetailPage() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    if (Esp32BaseWeb::hasParam("info")) {
        handleRecordInfoPage();
        return;
    }
    char text[24]{};
    const bool fromCalibration = calibrationContextRequested();
    const char* backHref = fromCalibration ? "/faucet/calibration" : "/faucet/records";
    const char* backLabel = fromCalibration ? "返回校准" : "返回记录";
    const char* detailPath = fromCalibration ? "/faucet/calibration/detail" : "/faucet/records/detail";
    const char* contextParam = fromCalibration ? "from=calibration&" : "";
    bool rawRequest = false;
    if (getParam("raw", text, sizeof(text))) {
        std::uint32_t rawValue = 0;
        rawRequest = parseU32(text, rawValue) && rawValue != 0;
    }
    bool rawTraceShowAll = false;
    if (getParam("all", text, sizeof(text))) {
        std::uint32_t allValue = 0;
        rawTraceShowAll = parseU32(text, allValue) && allValue != 0;
    }
    if (!contextReady()) {
        if (rawRequest) {
            sendPlainTextResponse(503, "上下文未就绪。\n");
        } else {
            Esp32BaseWeb::sendHeader("脉冲明细");
            Esp32BaseWeb::sendChunk("<h2>脉冲明细</h2><p class='err'>上下文未就绪。</p>");
            sendPageEnd();
        }
        return;
    }
    if (!fromCalibration) {
        if (rawRequest) {
            sendPlainTextResponse(404, "普通出水记录不提供脉冲明细。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("记录详情");
        Esp32BaseWeb::sendChunk("<h2>记录详情</h2><p class='err'>普通出水记录不提供脉冲明细。</p><p><a class='btn-link' href='/faucet/records'>返回记录</a></p>");
        sendPageEnd();
        return;
    }
    if (waterTaskActive()) {
        sendBusyJson("record_detail");
        return;
    }
    if (!g_context.pulseTraces) {
        if (rawRequest) {
            sendPlainTextResponse(503, "脉冲明细缓存不可用。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>脉冲明细缓存不可用。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t traceId = 0;
    if (!getParam("trace", text, sizeof(text)) || !parseU32(text, traceId)) {
        if (rawRequest) {
            sendPlainTextResponse(400, "明细编号无效。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>明细编号无效。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }
    std::uint32_t bucketSeconds = 1;
    if (getParam("bucket", text, sizeof(text))) {
        parseU32(text, bucketSeconds);
    }
    if (bucketSeconds != 2 && bucketSeconds != 3 && bucketSeconds != 4 && bucketSeconds != 5) {
        bucketSeconds = 1;
    }
    const WaterPulseTrace* trace = nullptr;
    trace = g_context.pulseTraces->findById(traceId);
    if (!trace) {
        if (rawRequest) {
            sendPlainTextResponse(404, "该脉冲明细不存在或已被 RAM 缓存淘汰。\n");
            return;
        }
        Esp32BaseWeb::sendHeader("脉冲明细");
        sendFmt("<h2>脉冲明细</h2><p class='err'>该脉冲明细不存在或已被 RAM 缓存淘汰。</p><p><a class='btn-link' href='%s'>%s</a></p>",
                backHref,
                backLabel);
        sendPageEnd();
        return;
    }

