tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
void handleFiltersPage() {
    if (!sendPageStart("滤芯状态")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }
    const std::uint32_t now = g_context.nowSeconds();
    char todayDate[16]{};
    formatDate(now >= kMinRealDateSeconds ? now : 0, todayDate, sizeof(todayDate));
    sendNoticeFromQuery();
    Esp32BaseWeb::sendChunk("<h2>滤芯</h2><table class='filters-table'><tr><th>名称</th><th>启用状态</th><th>已用天数 (天)</th><th>已用流量 (L)</th><th>寿命规则</th><th>状态</th><th>操作</th></tr>");
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        const FilterRecord& filter = g_context.filters->record(i);
        const std::uint32_t usedDays = filter.startTime >= kMinRealDateSeconds ? g_context.filters->usedDays(i, now) : 0;
        char life[32]{};
        formatLifeRange(filter, life, sizeof(life));
        sendFmt("<tr%s data-filter-start='%lu' data-filter-boot='%lu' data-filter-enabled='%u' data-filter-recommend-days='%lu' data-filter-max-days='%lu' data-filter-life-ml='%lu' data-filter-used-ml='%lu'><td>",
                filter.enabled ? "" : " class='disabled-row'",
                static_cast<unsigned long>(filter.startTime),
                static_cast<unsigned long>(filter.startBootId),
                filter.enabled ? 1U : 0U,
                static_cast<unsigned long>(filter.recommendDays),
                static_cast<unsigned long>(filter.maxDays),
                static_cast<unsigned long>(filter.lifeMl),
                static_cast<unsigned long>(filter.usedMl));
        sendHtmlEscapedBounded(filter.name, sizeof(filter.name));
        sendFmt("</td><td>%s</td><td class='filter-used-days'>%lu 天</td><td>",
                filter.enabled ? "启用" : "停用",
                static_cast<unsigned long>(usedDays));
        sendLiters(filter.usedMl);
        sendFmt("</td><td>%s", life);
        Esp32BaseWeb::sendChunk(" / ");
        if (filter.lifeMl > 0) {
            sendLiters(filter.lifeMl);
        } else {
            Esp32BaseWeb::sendChunk("未设置流量");
        }
        sendFmt("</td><td><span class='status-pill filter-status %s'>%s</span></td><td><div class='row-actions'><a href='/faucet/filters/edit?index=%u'>设置</a>",
                filterStatusClass(filter, usedDays),
                filterDisplayStatusText(filter, usedDays),
                static_cast<unsigned>(i));
        Esp32BaseWeb::sendChunk("<form method='post' action='/api/faucet/filters/reset' data-filter-name='");
        sendHtmlAttrEscapedBounded(filter.name, sizeof(filter.name));
        Esp32BaseWeb::sendChunk("' data-reset-date='");
        sendHtmlAttrEscaped(todayDate);
        Esp32BaseWeb::sendChunk("' onsubmit=\"return confirmFilterReset(this)&&once(this)\">");
        sendFmt("<input type='hidden' name='index' value='%u'>", static_cast<unsigned>(i));
        Esp32BaseWeb::sendChunk("<input class='secondary' type='submit' value='重置'></form></div></td></tr>");
    }
    Esp32BaseWeb::sendChunk("</table><script>"
                            "function confirmFilterReset(form){"
                            "var name=form.getAttribute('data-filter-name')||'滤芯';"
                            "var date=form.getAttribute('data-reset-date')||'';"
                            "var msg=date?('确认将【'+name+'】更换日期重置为 '+date+'，并清空已用流量？'):"
                            "('当前时间未同步。确认将【'+name+'】更换日期记录为本次开机未知时间，并清空已用流量？');"
                            "return confirm(msg);"
                            "}"
                            "(function(){"
                            "var unix2000=946684800;"
                            "document.querySelectorAll('tr[data-filter-start]').forEach(function(row){"
                            "var start=parseInt(row.getAttribute('data-filter-start')||'0',10);"
                            "var boot=parseInt(row.getAttribute('data-filter-boot')||'0',10);"
                            "if(boot){return;}"
                            "if(!start){return;}"
                            "var now=Math.floor(Date.now()/1000)-unix2000;"
                            "if(!isFinite(now)||now<=start){return;}"
                            "var days=Math.floor((now-start)/86400);"
                            "var used=row.querySelector('.filter-used-days');"
                            "if(used){used.textContent=days+' 天';}"
                            "var status=row.querySelector('.filter-status');"
                            "if(!status){return;}"
                            "var enabled=row.getAttribute('data-filter-enabled')==='1';"
                            "var rec=parseInt(row.getAttribute('data-filter-recommend-days')||'0',10);"
                            "var max=parseInt(row.getAttribute('data-filter-max-days')||'0',10);"
                            "var life=parseInt(row.getAttribute('data-filter-life-ml')||'0',10);"
                            "var flow=parseInt(row.getAttribute('data-filter-used-ml')||'0',10);"
                            "var text='正常';"
                            "var cls='status-ok';"
                            "if(!enabled){text='停用';}"
                            "if(!enabled){cls='status-muted';}"
                            "else if((life>0&&flow>=life)||(max>0&&days>=max)){text='已超期';cls='status-error';}"
                            "else if(rec>0&&days>=rec){text='建议更换';cls='status-warn';}"
                            "status.textContent=text;"
                            "status.classList.remove('status-ok','status-warn','status-error','status-muted');"
                            "status.classList.add(cls);"
                            "});"
                            "})();"
                            "</script>");
    sendPageEnd();
}

void handleFilterEditPage() {
    if (!sendPageStart("滤芯设置")) {
        return;
    }
    if (!requireContext()) {
        sendPageEnd();
        return;
    }

    char text[24]{};
    std::uint32_t index = 0;
    if (!getParam("index", text, sizeof(text)) || !parseU32(text, index) || index >= kFilterCount) {
        Esp32BaseWeb::sendChunk("<h2>滤芯设置</h2><section class='panel'><p>滤芯编号无效。</p>"
                                "<p><a href='/faucet/filters'>返回滤芯列表</a></p></section>");
        sendPageEnd();
        return;
    }

    const FilterRecord& filter = g_context.filters->record(index);
    sendNoticeFromQuery();
    sendFmt("<h2>第 %u 级滤芯设置</h2>"
            "<section class='panel'><form method='post' action='/api/faucet/filters' onsubmit='return once(this)'>"
            "<input type='hidden' name='index' value='%u'><input type='hidden' name='return' value='/faucet/filters'>"
            "<div class='form-grid'>",
            static_cast<unsigned>(index + 1),
            static_cast<unsigned>(index));
    Esp32BaseWeb::sendChunk("<div class='span-2'>");
    sendCheckbox("启用", "enabled", filter.enabled);
    Esp32BaseWeb::sendChunk("</div><label class='field span-6'><span>名称</span><input name='name' maxlength='");
    sendFmt("%u", static_cast<unsigned>(kFilterNameMaxChars));
    Esp32BaseWeb::sendChunk("' value='");
    sendHtmlAttrEscapedBounded(filter.name, sizeof(filter.name));
    Esp32BaseWeb::sendChunk("'><small class='hint'>最多 30 个字符，用于列表和状态页显示</small></label>"
                            "<div class='span-4'></div>");
    Esp32BaseWeb::sendChunk("<div class='span-3'>");
    sendMonthInput("建议更换周期（月）", "recommendMonths", filter.recommendDays);
    Esp32BaseWeb::sendChunk("</div><div class='span-3'>");
    sendMonthInput("最长使用周期（月）", "maxMonths", filter.maxDays);
    Esp32BaseWeb::sendChunk("</div><div class='span-3'>");
    sendVolumeInput("寿命流量（ml）", "lifeMl", filter.lifeMl);
    Esp32BaseWeb::sendChunk("<small class='hint'>0 表示不按流量判断</small></div><div class='span-3'>");
    sendDateInput("上次更换日期", "startDate", filter.startTime);
    Esp32BaseWeb::sendChunk("</div>");
    Esp32BaseWeb::sendChunk("</div><div class='form-actions'><input type='submit' value='保存'>"
                            "<a href='/faucet/filters'>取消</a></div></form></section>");
    sendPageEnd();
}

void handleApi() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    Esp32BaseWeb::sendJson(200, "{\"ok\":true,\"waterControl\":false}");
}

void handleAppCss() {
    if (!Esp32BaseWeb::checkAuth()) {
        return;
    }
    Esp32BaseWeb::sendResponseHeader("Cache-Control", "public, max-age=86400");
    Esp32BaseWeb::sendResponseHeader("X-Content-Type-Options", "nosniff");
    if (!Esp32BaseWeb::beginResponse(200, "text/css; charset=utf-8", nullptr)) {
        return;
    }
    sendAppCss();
    Esp32BaseWeb::endResponse();
}

bool sendJsonBuffer(bool ok, const char* json) {
    if (!ok) {
        Esp32BaseWeb::sendJson(500, "{\"error\":\"buffer_too_small\"}");
        return false;
    }
    Esp32BaseWeb::sendJson(200, json);
    return true;
}

bool contextReady() {
    if (!g_context.config || !g_context.configStore || !g_context.statistics || !g_context.app || !g_context.filters ||
        !g_context.records || !g_context.recordCalibrations || !g_context.recordCalibrationWriter ||
        !g_context.nowSeconds) {
        return false;
    }
    return true;
}

bool requireContext() {
    if (!contextReady()) {
        Esp32BaseWeb::sendJson(503, "{\"error\":\"context_not_ready\"}");
        return false;
    }
    return true;
}

void handleAfterFormatFs(const Esp32BaseWeb::FormatFsResult& result, void*) {
    if (!result.formatSuccess || !g_context.configStore || !g_context.statistics || !g_context.app) {
        return;
    }

    const StatisticsRecord current = g_context.app->snapshot().statistics;
    const PeriodKeys keys{current.lastDayKey, current.lastWeekKey, current.lastMonthKey};
    g_context.statistics->reset(keys);
    if (!g_context.configStore->resetStatistics(keys)) {
        g_context.app->markPersistenceDirtyForRetry();
    }
    if (g_context.afterFormatFs) {
        g_context.afterFormatFs();
    }
}

const char* configLoadStatusName(ConfigStore::LoadStatus status) {
    switch (status) {
        case ConfigStore::LoadStatus::Defaults:
            return "defaults";
        case ConfigStore::LoadStatus::LoadedCurrent:
            return "loaded_current";
    }
    return "unknown";
}

bool getParam(const char* name, char* out, std::size_t len) {
    return Esp32BaseWeb::hasParam(name) && Esp32BaseWeb::getParam(name, out, len);
}

void applyU32Param(const char* name, std::uint32_t& value) {
    char text[24]{};
    std::uint32_t parsed = 0;
    if (getParam(name, text, sizeof(text)) && parseU32(text, parsed)) {
        value = parsed;
    }
}

bool checkboxParam(const char* name) {
    return Esp32BaseWeb::hasParam(name);
}

void mergeChangedConfigFields(const SystemConfig& before, const SystemConfig& submitted, SystemConfig& target) {
    if (submitted.confirmTimeoutSec != before.confirmTimeoutSec) {
        target.confirmTimeoutSec = submitted.confirmTimeoutSec;
    }
    if (submitted.maxOutTimeSec != before.maxOutTimeSec) {
        target.maxOutTimeSec = submitted.maxOutTimeSec;
    }
    if (submitted.maxOutVolumeMl != before.maxOutVolumeMl) {
        target.maxOutVolumeMl = submitted.maxOutVolumeMl;
    }
    if (submitted.overflowPercent != before.overflowPercent) {
        target.overflowPercent = submitted.overflowPercent;
    }
    if (submitted.noFlowTimeoutSec != before.noFlowTimeoutSec) {
        target.noFlowTimeoutSec = submitted.noFlowTimeoutSec;
    }
    if (submitted.highFlowMlPerMin != before.highFlowMlPerMin) {
        target.highFlowMlPerMin = submitted.highFlowMlPerMin;
    }
    if (submitted.highFlowDurationSec != before.highFlowDurationSec) {
        target.highFlowDurationSec = submitted.highFlowDurationSec;
    }
    if (submitted.pauseTimeoutSec != before.pauseTimeoutSec) {
        target.pauseTimeoutSec = submitted.pauseTimeoutSec;
    }
    if (submitted.volumeAdjustStepMl != before.volumeAdjustStepMl) {
        target.volumeAdjustStepMl = submitted.volumeAdjustStepMl;
    }
    if (submitted.timeAdjustStepSec != before.timeAdjustStepSec) {
        target.timeAdjustStepSec = submitted.timeAdjustStepSec;
    }
    if (submitted.pulseMinIntervalUs != before.pulseMinIntervalUs) {
        target.pulseMinIntervalUs = submitted.pulseMinIntervalUs;
    }
    if (submitted.calibrationAnalysisPulseMinIntervalUs != before.calibrationAnalysisPulseMinIntervalUs) {
        target.calibrationAnalysisPulseMinIntervalUs = submitted.calibrationAnalysisPulseMinIntervalUs;
    }
    if (submitted.calibrationStableWindowSec != before.calibrationStableWindowSec) {
        target.calibrationStableWindowSec = submitted.calibrationStableWindowSec;
    }
    if (submitted.calibrationStableTolerancePercent != before.calibrationStableTolerancePercent) {
        target.calibrationStableTolerancePercent = submitted.calibrationStableTolerancePercent;
    }
    if (submitted.calibrationMinVolumeSpanMl != before.calibrationMinVolumeSpanMl) {
        target.calibrationMinVolumeSpanMl = submitted.calibrationMinVolumeSpanMl;
    }
    if (submitted.calibrationMaxErrorMl != before.calibrationMaxErrorMl) {
        target.calibrationMaxErrorMl = submitted.calibrationMaxErrorMl;
    }
    if (submitted.calibrationMaxRelativeErrorTenthPercent != before.calibrationMaxRelativeErrorTenthPercent) {
        target.calibrationMaxRelativeErrorTenthPercent = submitted.calibrationMaxRelativeErrorTenthPercent;
    }
    if (submitted.valveFullPowerSec != before.valveFullPowerSec) {
        target.valveFullPowerSec = submitted.valveFullPowerSec;
    }
    if (submitted.valveHoldDutyPercent != before.valveHoldDutyPercent) {
        target.valveHoldDutyPercent = submitted.valveHoldDutyPercent;
    }
    if (submitted.displaySleepSec != before.displaySleepSec) {
        target.displaySleepSec = submitted.displaySleepSec;
    }
    if (submitted.resultDisplaySec != before.resultDisplaySec) {
        target.resultDisplaySec = submitted.resultDisplaySec;
    }
    if (submitted.lcdI2cAddress != before.lcdI2cAddress) {
        target.lcdI2cAddress = submitted.lcdI2cAddress;
    }
    if (submitted.beepEnabled != before.beepEnabled) {
        target.beepEnabled = submitted.beepEnabled;
    }
    if (std::memcmp(submitted.presets, before.presets, sizeof(before.presets)) != 0) {
        std::memcpy(target.presets, submitted.presets, sizeof(target.presets));
    }
    for (std::size_t i = 0; i < kFilterCount; ++i) {
        FilterRecord submittedBase = submitted.filters[i];
        FilterRecord beforeBase = before.filters[i];
        submittedBase.startTime = beforeBase.startTime;
        submittedBase.usedMl = beforeBase.usedMl;
        submittedBase.startBootId = beforeBase.startBootId;
        if (std::memcmp(&submittedBase, &beforeBase, sizeof(FilterRecord)) != 0) {
            const std::uint32_t startTime = target.filters[i].startTime;
            const std::uint32_t usedMl = target.filters[i].usedMl;
            const std::uint32_t startBootId = target.filters[i].startBootId;
            target.filters[i] = submitted.filters[i];
            target.filters[i].startTime = startTime;
            target.filters[i].usedMl = usedMl;
            target.filters[i].startBootId = startBootId;
        }
    }
}

