tangyangguang/Esp32_Faucet/src/web/FaucetWeb.cpp
bool persistConfig(const SystemConfig& config) {
    if (!g_context.app->canApplyConfig()) {
        return false;
    }

    SystemConfig safe = g_context.configStore->loadSystemConfig();
    mergeChangedConfigFields(*g_context.config, config, safe);
    sanitizeConfig(safe);
    if (!g_context.configStore->saveSystemConfig(safe)) {
        return false;
    }
    if (!g_context.app->applyConfig(safe)) {
        return false;
    }
    *g_context.config = safe;
    if (g_context.applySettings) {
        g_context.applySettings(*g_context.config);
    }
    return true;
}

bool saveConfigAndReply(const SystemConfig& config) {
    if (!g_context.app->canApplyConfig()) {
        Esp32BaseWeb::sendJson(409, "{\"error\":\"busy\",\"restartRecommended\":true}");
        return false;
    }
    const bool ok = persistConfig(config);
    Esp32BaseWeb::sendJson(ok ? 200 : 500,
                           ok ? "{\"ok\":true,\"restartRecommended\":true}" : "{\"error\":\"save_failed\"}");
    return ok;
}

bool readTdsCalibrationInput(std::uint16_t& referencePpm, bool allowZero) {
    char text[32]{};
    std::uint32_t value = 0;
    if (!getParam("referencePpm", text, sizeof(text)) || !parseU32(text, value) ||
        value > 2000 || (!allowZero && value == 0)) {
        return false;
    }
    referencePpm = static_cast<std::uint16_t>(value);
    return true;
}

bool readTemperatureCalibrationInput(std::int16_t& referenceCentiC) {
    char text[32]{};
    float referenceC = 0.0f;
    if (getParam("referenceC", text, sizeof(text))) {
        if (!parseFloat(text, referenceC) || referenceC < 0.0f || referenceC > 90.0f) {
            return false;
        }
        referenceCentiC = static_cast<std::int16_t>(referenceC * 100.0f + 0.5f);
        return true;
    }

    std::uint32_t legacy = 0;
    if (!getParam("referenceCentiC", text, sizeof(text)) || !parseU32(text, legacy) || legacy > 9000) {
        return false;
    }
    referenceCentiC = static_cast<std::int16_t>(legacy);
    return true;
}

void persistTdsCalibrationResult(bool ok, const char* success, const char* failure) {
    if (!ok || !g_context.app || !g_context.config || !g_context.configStore) {
        redirectCalibrationFailure(failure);
        return;
    }
    const SystemConfig updated = g_context.app->config();
    if (!g_context.configStore->saveSystemConfig(updated)) {
        redirectCalibrationFailure("save_failed");
        return;
    }
    *g_context.config = updated;
    if (g_context.applySettings) {
        g_context.applySettings(*g_context.config);
    }
    redirectCalibrationResult(true, success, failure);
}

void handleCalibrationPost() {
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (!Esp32BaseWeb::checkPostAllowed("faucet_calibration")) {
        return;
    }
    char text[32]{};
    if (!getParam("action", text, sizeof(text))) {
        redirectCalibrationFailure("invalid_action");
        return;
    }
    if (std::strcmp(text, "temperature_save") == 0) {
        std::int16_t reference = 0;
        if (!readTemperatureCalibrationInput(reference)) {
            redirectCalibrationFailure("invalid_value");
            return;
        }
        const bool updated = g_context.app && g_context.app->saveTemperatureCalibrationForWeb(reference);
        if (!updated || !g_context.configStore->saveSystemConfig(g_context.app->config())) {
            redirectCalibrationFailure("save_failed");
            return;
        }
        *g_context.config = g_context.app->config();
        if (g_context.applySettings) {
            g_context.applySettings(*g_context.config);
        }
        redirectCalibrationResult(true, "temperature", "save_failed");
        return;
    }
    if (std::strcmp(text, "tds_start_single") == 0) {
        std::uint16_t referencePpm = 0;
        if (!readTdsCalibrationInput(referencePpm, false)) {
            redirectCalibrationFailure("invalid_value");
            return;
        }
        redirectCalibrationResult(g_context.app &&
                                      g_context.app->startTdsSinglePointCalibrationForWeb(
                                          referencePpm,
                                          g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "tds_calibration_started",
                                  "busy");
        return;
    }
    if (std::strcmp(text, "tds_start_low") == 0) {
        std::uint16_t referencePpm = 0;
        if (!readTdsCalibrationInput(referencePpm, true)) {
            redirectCalibrationFailure("invalid_value");
            return;
        }
        redirectCalibrationResult(g_context.app &&
                                      g_context.app->startTdsTwoPointLowCalibrationForWeb(
                                          referencePpm,
                                          g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "tds_low_started",
                                  "busy");
        return;
    }
    if (std::strcmp(text, "tds_start_high") == 0) {
        std::uint16_t referencePpm = 0;
        if (!readTdsCalibrationInput(referencePpm, false)) {
            redirectCalibrationFailure("invalid_value");
            return;
        }
        redirectCalibrationResult(g_context.app &&
                                      g_context.app->startTdsTwoPointHighCalibrationForWeb(
                                          referencePpm,
                                          g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                  "tds_high_started",
                                  "busy");
        return;
    }
    if (std::strcmp(text, "tds_cancel") == 0) {
        redirectCalibrationResult(g_context.app && g_context.app->cancelTdsCalibrationForWeb(),
                                  "tds_cancelled",
                                  "invalid_state");
        return;
    }
    if (std::strcmp(text, "tds_save") == 0) {
        persistTdsCalibrationResult(g_context.app &&
                                        g_context.app->saveTdsCalibrationForWeb(
                                            g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                    "tds_saved",
                                    "invalid_state");
        return;
    }
    if (std::strcmp(text, "calibrate") == 0) {
        handleRecordCalibrationApi();
        return;
    }
    if (std::strcmp(text, "generate_segmented") == 0) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_action");
        return;
    }
    if (std::strcmp(text, "save_generated_scheme") == 0) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_action");
        return;
    }
    redirectCalibrationFailure("invalid_action");
}

void handleFlowCalibrationPost() {
    if (!Esp32BaseWeb::isMethod(Esp32BaseWeb::METHOD_POST)) {
        Esp32BaseWeb::sendJson(405, "{\"error\":\"method_not_allowed\"}");
        return;
    }
    if (!Esp32BaseWeb::checkPostAllowed("faucet_metering")) {
        return;
    }
    char text[32]{};
    if (!getParam("action", text, sizeof(text))) {
        Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_value");
        return;
    }
    if (std::strcmp(text, "start_session") == 0) {
        if (waterTaskActive()) {
            redirectFlowCalibrationFailure("busy");
            return;
        }
        if (!calibrationSessionStorageReady()) {
            redirectFlowCalibrationFailure("calibration_storage_unavailable");
            return;
        }
        redirectFlowCalibrationResult(g_context.app && g_context.app->startCalibrationSessionForWeb(
                                                       g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                      "session_started",
                                      "invalid_state");
        return;
    }
    if (std::strcmp(text, "discard_session") == 0) {
        redirectFlowCalibrationResult(g_context.app && g_context.app->discardCalibrationSessionForWeb(
                                                       g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                      "session_discarded",
                                      "invalid_state");
        return;
    }
    if (std::strcmp(text, "save_actual") == 0) {
        std::uint32_t actualMl = 0;
        if (!getParam("actualMl", text, sizeof(text)) || !parseU32(text, actualMl) ||
            actualMl < kCalibrationMinActualMl || actualMl > kMaxVolumePresetMl) {
            redirectFlowCalibrationFailure("invalid_value");
            return;
        }
        redirectFlowCalibrationResult(g_context.app && g_context.app->submitCalibrationActualForWeb(
                                                       actualMl, g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                      "actual",
                                      "save_failed");
        return;
    }
    if (std::strcmp(text, "skip_attempt") == 0) {
        redirectFlowCalibrationResult(g_context.app && g_context.app->skipCalibrationAttemptForWeb(
                                                       CalibrationSkipReason::Mistake,
                                                       g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                      "attempt_skipped",
                                      "invalid_state");
        return;
    }
    if (std::strcmp(text, "save_long_term_sample") == 0) {
        std::uint32_t attemptIndex = 0;
        if (!getParam("attemptIndex", text, sizeof(text)) || !parseU32(text, attemptIndex) ||
            attemptIndex >= kCalibrationMaxAttempts) {
            redirectFlowCalibrationFailure("invalid_value");
            return;
        }
        std::uint32_t sampleId = 0;
        redirectFlowCalibrationResult(
            g_context.app &&
                g_context.app->saveCalibrationSessionSampleToLongTermForWeb(
                    static_cast<std::uint8_t>(attemptIndex),
                    g_context.nowSeconds ? g_context.nowSeconds() : 0,
                    sampleId),
            "long_term_sample",
            "save_failed");
        return;
    }
    if (std::strcmp(text, "remove_sample") == 0) {
        std::uint32_t attemptIndex = 0;
        if (!getParam("attemptIndex", text, sizeof(text)) || !parseU32(text, attemptIndex) ||
            attemptIndex >= kCalibrationMaxAttempts) {
            redirectFlowCalibrationFailure("invalid_value");
            return;
        }
        if (waterTaskActive()) {
            redirectFlowCalibrationFailure("busy");
            return;
        }
        redirectFlowCalibrationResult(g_context.app && g_context.app->removeCalibrationSessionSampleForWeb(
                                                       static_cast<std::uint8_t>(attemptIndex),
                                                       g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                      "sample_removed",
                                      "invalid_state");
        return;
    }
    if (std::strcmp(text, "generate_session") == 0) {
        redirectFlowCalibrationResult(g_context.app && g_context.app->generateCalibrationForWeb(
                                                       g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                      "generated",
                                      "sample_not_enough");
        return;
    }
    if (std::strcmp(text, "apply_session") == 0) {
        redirectFlowCalibrationResult(g_context.app && g_context.app->applyGeneratedCalibrationForWeb(
                                                       g_context.nowSeconds ? g_context.nowSeconds() : 0),
                                      "applied",
                                      "no_generated_result");
        return;
    }
    if (std::strcmp(text, "generate_segmented") == 0) {
        handleGenerateSegmentedCalibrationApi();
        return;
    }
    if (std::strcmp(text, "save_generated_scheme") == 0) {
        handleSaveGeneratedSchemeApi();
        return;
    }
    if (std::strcmp(text, "discard_generated_scheme") == 0) {
        handleDiscardGeneratedSchemeApi();
        return;
    }
    if (std::strcmp(text, "create_metering_scheme") == 0) {
        handleCreateMeteringSchemeApi();
        return;
    }
    if (std::strcmp(text, "edit_metering_scheme") == 0) {
        handleEditMeteringSchemeApi();
        return;
    }
    if (std::strcmp(text, "set_active_metering_scheme") == 0) {
        handleSetActiveMeteringSchemeApi();
        return;
    }
    if (std::strcmp(text, "delete_metering_scheme") == 0) {
        handleDeleteMeteringSchemeApi();
        return;
    }
    Esp32BaseWeb::redirectSeeOther("/faucet/calibration/flow?error=invalid_value");
}

bool persistFilterConfig(const FilterRecord& record, std::size_t index) {
    if (!g_context.app->canApplyConfig() || index >= kFilterCount) {
        return false;
    }

